brew "bash"
brew "git"
brew "gh"
brew "glab"
brew "direnv" # .envrc
brew "readline" # .pythonrc
brew "gettext"
brew "peco"
brew "zsh"
brew "zplug"
brew "tmux"
brew "ripgrep"
brew "eza"
brew "bat"
brew "procs"
brew "hexyl"
brew "fd"
brew "tokei"
brew "jq"
brew "yq"
brew "htop"
brew "nkf"
brew "ghq"
brew "openssl"
brew "zlib"
brew "watch"
brew "aspell"
brew "unar"
brew "nmap"
brew "shellcheck" # flymake
brew "autoconf"
brew "automake"
brew "gcc"
brew "cmake"
brew "libvterm"
brew "libtool"
brew "cheat"
brew "hadolint"
brew "difftastic"
brew "kind"

# GNU tools
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "binutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "pandoc"
brew "wget"
brew "unzip"
brew "gnu-time"
brew "gnupg"

# cask
cask "google-chrome"
cask "docker"
cask "multipass"

# python
brew "pipenv"

# go
brew "golangci/tap/golangci-lint"

# rust
brew "rust-analyzer"

# clang
brew "llvm"
brew "clang-format"

# clojure
brew "clojure/tools/clojure"
brew "leiningen"
brew "clojure-lsp/brew/clojure-lsp-native"

# terraform
tap "hashicorp/tap"
brew "tfenv"
brew "hashicorp/tap/terraform-ls"

# plantuml
brew "plantuml"
