brew "direnv" # .envrc
brew "gettext"
brew "nkf"
brew "openssl"
brew "zlib"
brew "zstd"
brew "unar"
brew "autoconf"
brew "automake"
brew "gcc"
brew "cmake"
brew "libtool"

# git
brew "git"
brew "ghq"

# emacs
brew "libvterm"
brew "aspell"
brew "plantuml"

# shell
brew "bash"
brew "zsh"
brew "tmux"
brew "zplug"
brew "shellcheck" # flymake
brew "shfmt" # formatter

# util
brew "fastfetch"
brew "btop"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "eza"
brew "procs"
brew "hexyl"
brew "fd"
brew "watch"
brew "nmap"
brew "graphviz"
brew "wget"
brew "tree"
brew "pstree"
brew "osv-scanner"
brew "duckdb"
brew "ollama"

# github
brew "gh"
brew "pinact"
brew "actionlint"
brew "ghalint"

# docker
brew "hadolint"
brew "lazydocker"
brew "dive"
brew "crane"

# container
brew "lima"

# kubernetes
brew "kind"
brew "helm"
tap "derailed/k9s"
brew "derailed/k9s/k9s"
brew "stern"

# GNU tools
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "binutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "pandoc"
brew "unzip"
brew "gnu-time"
brew "gnupg"

# cask

# python
brew "readline" # .pythonrc

# rust
brew "rust-analyzer"

# clang
brew "llvm"
brew "clang-format" # formatter

# terraform
tap "hashicorp/tap"
brew "tfenv"
brew "hashicorp/tap/terraform-ls"
brew "terraform-lsp"

# php
brew "composer"
brew "psysh"
brew "php-cs-fixer" # formatter

# lua
brew "lua"
brew "lua-language-server"
brew "stylua" # formatter

# js, ts
brew "deno"
brew "pnpm"

# java
brew "openjdk"

# subversion
brew "subversion"

# data transform
brew "jq"
brew "yq"
brew "fx"
brew "gron"
brew "taplo" # formatter
brew "dasel"

# ai
brew "gemini-cli"
