brew "git"
brew "gh"
brew "glab"
brew "direnv" # .envrc
brew "gettext"
brew "nkf"
brew "openssl"
brew "zlib"
brew "zstd"
brew "unar"
brew "autoconf"
brew "automake"
brew "gcc"
brew "cmake"
brew "libtool"

# emacs
brew "libvterm"
brew "aspell"
brew "plantuml"

# shell
brew "bash"
brew "zsh"
brew "tmux"
brew "zplug"
brew "shellcheck" # flymake
brew "shfmt" # formatter

# util
brew "peco"
brew "ripgrep"
brew "eza"
brew "procs"
brew "hexyl"
brew "fd"
brew "jq"
brew "yq"
brew "htop"
brew "ghq"
brew "watch"
brew "nmap"
brew "graphviz"
brew "wget"
brew "tree"

# docker
brew "hadolint"

# kubernetes
brew "kind"
brew "helm"

# GNU tools
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "binutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "pandoc"
brew "wget"
brew "unzip"
brew "gnu-time"
brew "gnupg"

# cask
cask "multipass"
cask "devtoys"

# python
brew "pipenv"
brew "readline" # .pythonrc

# go
brew "golangci-lint"

# rust
brew "rust-analyzer"

# clang
brew "llvm"
brew "clang-format" # formatter

# clojure
brew "clojure-compiler"
brew "leiningen"
brew "clojure-lsp"

# terraform
tap "hashicorp/tap"
brew "tfenv"
brew "hashicorp/tap/terraform-ls"
brew "terraform-lsp"

# php
brew "composer"
brew "psysh"
brew "php-cs-fixer" # formatter

# lua
brew "lua"
brew "lua-language-server"
brew "stylua" # formatter

# js, ts
brew "deno"

# java
brew "openjdk"

# scala
brew "coursier" # for formatter

# toml
brew "taplo" # formatter
